src/Catalogs/ПараметрыПодключенияКластер1С/ПараметрыПодключенияКластер1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыПодключенияКластер1С</name>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипПодключенияКластер1С</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АгентКИППараметры</name>
    <attributes>
      <name>АгентКИП</name>
      <type>
        <types>CatalogRef.АгентыКИП</types>
      </type>
    </attributes>
    <attributes>
      <name>Активный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПортRAS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RASПараметры</name>
    <attributes>
      <name>АдресСервераАдминистрирования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПортСервераАдминистрирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>COMПараметры</name>
    <attributes>
      <name>АдресКластера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПортАгентаКластера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПортКластера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипПодключенияКластер1С/ТипПодключенияКластер1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПодключенияКластер1С</name>
  <enumValues>
    <name>АгентКИП</name>
  </enumValues>
  <enumValues>
    <name>RAS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПараметрыПодключенияКластер1С/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеПроцедуры

Процедура ПередЗаписью(Отказ)
    
    Если ДополнительныеСвойства.Свойство("СформированитьНаименование") И ДополнительныеСвойства.СформированитьНаименование Тогда
        СформироватьНаименование();
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование()
    
    Наименование = Строка(ТипПодключения) + " (";
    
    Если ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипПодключенияКластер1С.RAS") Тогда
        Для Каждого ТекСтрока Из RASПараметры Цикл
            Наименование = Наименование + ТекСтрока.СерверАдминистрирования + ", ";
        КонецЦикла;
    ИначеЕсли ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипПодключенияКластер1С.АгентКИП") Тогда
        Для Каждого ТекСтрока Из АгентКИППараметры Цикл
            Наименование = Наименование + ТекСтрока.АгентКИП + ":" + Формат(ТекСтрока.ПортRAS, "ЧН=0; ЧГ=0") + ", ";
        КонецЦикла;
    КонецЕсли;
    
    Наименование = Лев(Наименование, СтрДлина(Наименование) - 2);
    Наименование = Наименование + ")";
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
